Обработки/Reports/_ОтчетВознаграждениеАгентаЗаСопровождение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетВознаграждениеАгентаЗаСопровождение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетВознаграждениеАгентаЗаСопровождение/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Вознаграждение агента за сопровождение",
		"0.5",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ВыбратьДанныеПоРасчетуВознагражденияАгента()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаРасчета",		КонецДня(Период));
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("АгентскийДоговор",	АгентскийДоговор);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	ЕСТЬNULL(СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия, ЗНАЧЕНИЕ(Справочник.СтратегииИндивидуальногоИнвестирования.ПустаяСсылка)) КАК Стратегия,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.СтавкаВознаграждения, 0) КАК СтавкаВознагражденияЗаУправление,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.БазаДляРасчетаВознаграждения, ЗНАЧЕНИЕ(Справочник.БазыРасчета.ПустаяСсылка)) КАК БазаРасчета,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения, ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.ПустаяСсылка)) КАК ПериодичностьРасчетаВознаграждения,
		|	ВЫБОР
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, КВАРТАЛ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, ГОД)
		|	КОНЕЦ КАК НачалоБазовогоПериода,
		|	ВЫБОР
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, КВАРТАЛ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, ГОД)
		|	КОНЕЦ КАК КонецБазовогоПериода,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.СтавкаВознагражденияЗаПривлечение, 0) КАК СтавкаВознагражденияЗаПривлечение,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.БазаДляРасчетаВознагражденияЗаПривлечение, ЗНАЧЕНИЕ(Справочник.БазыРасчета.ПустаяСсылка)) КАК БазаРасчетаВознагражденияЗаПривлечение,
		|	ЕСТЬNULL(УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение, ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.ПустаяСсылка)) КАК ПериодичностьРасчетаВознагражденияЗаПривлечение,
		|	ВЫБОР
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, КВАРТАЛ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаРасчета, ГОД)
		|	КОНЕЦ КАК НачалоБазовогоПериодаВознагражденияЗаПривлечение,
		|	ВЫБОР
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежемесячно)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, МЕСЯЦ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежеквартально)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, КВАРТАЛ)
		|		КОГДА УсловияАгентскихДоговоровСрезПоследних.ПериодичностьРасчетаВознагражденияЗаПривлечение = ЗНАЧЕНИЕ(Перечисление.ПериодичностьРасчетаВознагражденияУправляющего.Ежегодно)
		|			ТОГДА КОНЕЦПЕРИОДА(&ДатаРасчета, ГОД)
		|	КОНЕЦ КАК КонецБазовогоПериодаВознагражденияЗаПривлечение,
		|	СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|		И СчетаДоверительногоУправления.ДатаРасторжения < &ДатаРасчета КАК ДоговорЗакрыт,
		|	ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытияАгентскогоДоговора
		|ПОМЕСТИТЬ _НастройкиРасчетаВознаграждения
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&ДатаРасчета, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияАгентскихДоговоров.СрезПоследних(&ДатаРасчета, ) КАК УсловияАгентскихДоговоровСрезПоследних
		|		ПО СчетаДоверительногоУправления.АгентскийДоговор = УсловияАгентскихДоговоровСрезПоследних.Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ДатаРасчета, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО СчетаДоверительногоУправления.АгентскийДоговор = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И СчетаДоверительногоУправления.АгентскийДоговор = &АгентскийДоговор
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиРасчетаВознаграждения.БазаРасчета КАК БазаРасчета,
		|	_НастройкиРасчетаВознаграждения.ПериодичностьРасчетаВознаграждения КАК ПериодичностьРасчетаВознаграждения,
		|	_НастройкиРасчетаВознаграждения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НастройкиРасчетаВознаграждения.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	_НастройкиРасчетаВознаграждения.КонецБазовогоПериода КАК КонецБазовогоПериода,
		|	_НастройкиРасчетаВознаграждения.ДатаЗакрытияАгентскогоДоговора КАК ДатаЗакрытияАгентскогоДоговора,
		|	_НастройкиРасчетаВознаграждения.БазаРасчетаВознагражденияЗаПривлечение КАК БазаРасчетаВознагражденияЗаПривлечение,
		|	_НастройкиРасчетаВознаграждения.ПериодичностьРасчетаВознагражденияЗаПривлечение КАК ПериодичностьРасчетаВознагражденияЗаПривлечение,
		|	_НастройкиРасчетаВознаграждения.НачалоБазовогоПериодаВознагражденияЗаПривлечение КАК НачалоБазовогоПериодаВознагражденияЗаПривлечение,
		|	_НастройкиРасчетаВознаграждения.КонецБазовогоПериодаВознагражденияЗаПривлечение КАК КонецБазовогоПериодаВознагражденияЗаПривлечение
		|ИЗ
		|	_НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
		|ИТОГИ ПО
		|	БазаРасчета,
		|	ПериодичностьРасчетаВознаграждения";
	#КонецОбласти
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивДанныхДляРасчета = Новый Массив;
	
	ВыборкаБазаРасчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаБазаРасчета.Следующий() Цикл
	
		ВыборкаПериодичностьРасчета = ВыборкаБазаРасчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПериодичностьРасчета.Следующий() Цикл
			
			ОпределенаБаза			= ЗначениеЗаполнено(ВыборкаПериодичностьРасчета.БазаРасчета);
			ОпределенаПериодичность	= ЗначениеЗаполнено(ВыборкаПериодичностьРасчета.ПериодичностьРасчетаВознаграждения);
			
			ТекстОшибки = "";
			
			Если Не (ОпределенаБаза И ОпределенаПериодичность) Тогда
				ТекстОшибки = "Для счета доверительного управления '%1' не удалось определить ";
				ТекстОшибки = ТекстОшибки + ?(ОпределенаБаза, "", "базу");
				ТекстОшибки = ТекстОшибки + ?(ОпределенаПериодичность, "", ?(ОпределенаБаза, "", " и ") + "периодичность") + " расчета вознаграждения. Расчет вознаграждения не выполнен";
			КонецЕсли;				
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Выборка = ВыборкаПериодичностьРасчета.Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.СчетДоверительногоУправления), Выборка.СчетДоверительногоУправления);
				КонецЦикла;
				
				Продолжить;
				
			КонецЕсли; 
			
			ПараметрыПолученияБазы = Новый Структура;             			
			ПараметрыПолученияБазы.Вставить("Организация", 						Организация);
			ПараметрыПолученияБазы.Вставить("ДатаРасчета",						Период);
			ПараметрыПолученияБазы.Вставить("БазаРасчета", 						ВыборкаПериодичностьРасчета.БазаРасчета);
			ПараметрыПолученияБазы.Вставить("СчетаДоверительногоУправления", 	Новый Массив);  
			
			// Параметр РассчитыватьЗаБазовыйПериод: 
			// Истина - вознаграждение рассчитывается, только если ДатаРасчета на границе базового периода (конец месяца, квартала)
			// Ложь - вознаграждение рассчитывается за период до ДатаРасчета
			ПараметрыПолученияБазы.Вставить("РассчитыватьЗаБазовыйПериод",  	Ложь);
			
			ПараметрыПолученияБазыЗаПривлечение = Новый Структура;
			Если РезультатЗапроса.Колонки.Найти("БазаРасчетаВознагражденияЗаПривлечение") <> Неопределено Тогда
				ПараметрыПолученияБазыЗаПривлечение.Вставить("Организация", Организация);
				ПараметрыПолученияБазыЗаПривлечение.Вставить("ДатаРасчета", Период);
				ПараметрыПолученияБазыЗаПривлечение.Вставить("СчетаДоверительногоУправления", Новый Массив);  		
			КонецЕсли;
			
			ТекстОшибки = "";
			ОпределенаБаза = Истина;
			ОпределенаПериодичность = Истина;
			
			Выборка = ВыборкаПериодичностьРасчета.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ПараметрыПолученияБазы.Вставить("НачалоБазовогоПериода", Выборка.НачалоБазовогоПериода);
				ПараметрыПолученияБазы.Вставить("КонецБазовогоПериода",  Выборка.КонецБазовогоПериода);
				
				ПараметрыПолученияБазы.СчетаДоверительногоУправления.Добавить(Выборка.СчетДоверительногоУправления);
				
				Если РезультатЗапроса.Колонки.Найти("БазаРасчетаВознагражденияЗаПривлечение") <> Неопределено Тогда
					ПараметрыПолученияБазыЗаПривлечение.Вставить("БазаРасчета", 		  			Выборка.БазаРасчетаВознагражденияЗаПривлечение);
					ПараметрыПолученияБазыЗаПривлечение.Вставить("НачалоБазовогоПериода", 			Выборка.НачалоБазовогоПериодаВознагражденияЗаПривлечение);
					ПараметрыПолученияБазыЗаПривлечение.Вставить("КонецБазовогоПериода",  			Выборка.КонецБазовогоПериодаВознагражденияЗаПривлечение);
					
					ОпределенаБаза         = ЗначениеЗаполнено(Выборка.БазаРасчетаВознагражденияЗаПривлечение);
					ОпределенаПериодичность = ЗначениеЗаполнено(Выборка.НачалоБазовогоПериодаВознагражденияЗаПривлечение) И ЗначениеЗаполнено(Выборка.КонецБазовогоПериодаВознагражденияЗаПривлечение);
			
					// Вознаграждение агенту нужно рассчитывать с заданной периодичностью, если агентский договор не закрыт
					ПараметрыПолученияБазыЗаПривлечение.Вставить("РассчитыватьЗаБазовыйПериод",  	?(Выборка.ДатаЗакрытияАгентскогоДоговора = '00010101', Истина, Ложь));
					ПараметрыПолученияБазы.Вставить("РассчитыватьЗаБазовыйПериод",  				?(Выборка.ДатаЗакрытияАгентскогоДоговора = '00010101', Истина, Ложь));
				
					ПараметрыПолученияБазыЗаПривлечение.СчетаДоверительногоУправления.Добавить(Выборка.СчетДоверительногоУправления);
				КонецЕсли;
			
			КонецЦикла; 
						
			Если Не (ОпределенаБаза И ОпределенаПериодичность) Тогда
				ТекстОшибки = "Для счета доверительного управления '%1' не удалось определить ";
				ТекстОшибки = ТекстОшибки + ?(ОпределенаБаза, "", "базу");
				ТекстОшибки = ТекстОшибки + ?(ОпределенаПериодичность, "", ?(ОпределенаБаза, "", " и ") + "периодичность") + " расчета вознаграждения за привлечение. Расчет вознаграждения не выполнен";
			КонецЕсли;				
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Выборка.Сбросить();
				Пока Выборка.Следующий() Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.СчетДоверительногоУправления), Выборка.СчетДоверительногоУправления);
				КонецЦикла;
				
				Продолжить;
				
			КонецЕсли;
			
			ИсходныеТаблицы = "_НастройкиРасчетаВознаграждения";
			
			Запрос.УстановитьПараметр("НачалоБазовогоПериода", ПараметрыПолученияБазы.НачалоБазовогоПериода);
			Запрос.УстановитьПараметр("КонецБазовогоПериода",  ПараметрыПолученияБазы.КонецБазовогоПериода);
			
			Справочники.БазыРасчета.ПолучитьЗначенияБазРасчета(ПараметрыПолученияБазы, Запрос.МенеджерВременныхТаблиц);
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_БазыРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	_НастройкиРасчетаВознаграждения.Стратегия КАК Стратегия,
				|	_НастройкиРасчетаВознаграждения.СтавкаВознагражденияЗаУправление КАК Ставка,
				|	ВЫРАЗИТЬ(_БазыРасчета.БалансоваяСтоимость КАК ЧИСЛО(25, 2)) КАК БалансоваяСтоимость,
				|	ВЫБОР
				|		КОГДА _НастройкиРасчетаВознаграждения.ДоговорЗакрыт
				|			ТОГДА 0
				|		ИНАЧЕ ВЫРАЗИТЬ(_БазыРасчета.СредняяОценочнаяСтоимость * _НастройкиРасчетаВознаграждения.СтавкаВознагражденияЗаУправление / 100 КАК ЧИСЛО(15, 2))
				|	КОНЕЦ КАК СуммаВознаграждения,
				|	_НастройкиРасчетаВознаграждения.ДатаЗаключения КАК ДатаЗаключения,
				|	_НастройкиРасчетаВознаграждения.НомерДоговора КАК НомерДоговора,
				|	ВЫБОР
				|		КОГДА _НастройкиРасчетаВознаграждения.ДоговорЗакрыт
				|			ТОГДА 0
				|		ИНАЧЕ ВЫРАЗИТЬ(_БазыРасчета.СредняяОценочнаяСтоимость КАК ЧИСЛО(25, 2))
				|	КОНЕЦ КАК СредняяОценочнаяСтоимость,
				|	_НастройкиРасчетаВознаграждения.ДоговорЗакрыт КАК ДоговорЗакрыт,
				|	ВЫБОР
				|		КОГДА ПервыеВводыАктивов.ДатаПервогоВвода >= _НастройкиРасчетаВознаграждения.НачалоБазовогоПериода
				|			ТОГДА ПервыеВводыАктивов.ДатаПервогоВвода
				|		КОГДА _НастройкиРасчетаВознаграждения.НачалоБазовогоПериода >= _НастройкиРасчетаВознаграждения.ДатаЗаключения
				|			ТОГДА _НастройкиРасчетаВознаграждения.НачалоБазовогоПериода
				|		ИНАЧЕ _НастройкиРасчетаВознаграждения.ДатаЗаключения
				|	КОНЕЦ КАК НачалоПериодаНачисления,
				|	ВЫБОР
				|		КОГДА _НастройкиРасчетаВознаграждения.КонецБазовогоПериода < _НастройкиРасчетаВознаграждения.ДатаРасторжения
				|				ИЛИ _НастройкиРасчетаВознаграждения.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА _НастройкиРасчетаВознаграждения.КонецБазовогоПериода
				|		ИНАЧЕ КОНЕЦПЕРИОДА(_НастройкиРасчетаВознаграждения.ДатаРасторжения, ДЕНЬ)
				|	КОНЕЦ КАК КонецПериодаНачисления
				|ИЗ
				|	_БазыРасчета КАК _БазыРасчета
				|		ЛЕВОЕ СОЕДИНЕНИЕ _НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
				|		ПО _БазыРасчета.СчетДоверительногоУправления = _НастройкиРасчетаВознаграждения.СчетДоверительногоУправления
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			_НастройкиРасчетаВознаграждения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|			НАЧАЛОПЕРИОДА(МИНИМУМ(ВводыАктивов.Период), ДЕНЬ) КАК ДатаПервогоВвода
				|		ИЗ
				|			_НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыАктивов
				|				ПО (ВводыАктивов.Организация = _НастройкиРасчетаВознаграждения.Организация)
				|					И (ВводыАктивов.СчетДоверительногоУправления = _НастройкиРасчетаВознаграждения.СчетДоверительногоУправления)
				|					И (ВводыАктивов.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход))
				|					И (ВводыАктивов.Период <= _НастройкиРасчетаВознаграждения.КонецБазовогоПериода)
				|		
				|		СГРУППИРОВАТЬ ПО
				|			_НастройкиРасчетаВознаграждения.СчетДоверительногоУправления) КАК ПервыеВводыАктивов
				|		ПО (ПервыеВводыАктивов.СчетДоверительногоУправления = _БазыРасчета.СчетДоверительногоУправления)
				|
				|УПОРЯДОЧИТЬ ПО
				|	_БазыРасчета.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления,
				|	_БазыРасчета.СчетДоверительногоУправления.Наименование";  	
			
			МассивДанныхДляРасчета.Добавить(Запрос.Выполнить());
			
		КонецЦикла;
	КонецЦикла;
	
	Если МассивДанныхДляРасчета.Количество() = 1 Тогда
		Возврат МассивДанныхДляРасчета[0];
		
	ИначеЕсли МассивДанныхДляРасчета.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные для расчета вознаграждения не найдены");
		Возврат Неопределено;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчет вознаграждения с различной периодичностью или по разным базам не поддерживается");
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,АгентскийДоговор");

	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	// Получение данных
	ДанныеПоРасчетуВознаграждения = ВыбратьДанныеПоРасчетуВознагражденияАгента();
	
	Если ДанныеПоРасчетуВознаграждения = Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.НачалоПериода	= Формат(НачалоКвартала(Период), "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КонецПериода		= Формат(КонецКвартала(Период), "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора	= АгентскийДоговор.НомерДоговора;
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(АгентскийДоговор.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ИтогоСтоимость		= 0;
	ИтогоВознаграждение	= 0;
	НомерСтроки			= 1;
	
	Для Каждого Строка Из ДанныеПоРасчетуВознаграждения.Выгрузить() Цикл
		
		Если Строка.СуммаВознаграждения = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомерСтроки		= НомерСтроки;
		ОбластьСтрока.Параметры.Клиент			= Строка.СчетДоверительногоУправления;
		ОбластьСтрока.Параметры.Стратегия		= Строка.Стратегия;
		ОбластьСтрока.Параметры.НомерДоговора	= Строка.НомерДоговора;
		ОбластьСтрока.Параметры.ДатаДоговора	= Строка.ДатаЗаключения;
		ОбластьСтрока.Параметры.Стоимость		= Строка.СредняяОценочнаяСтоимость;
		ОбластьСтрока.Параметры.Ставка			= Строка.Ставка;
		ОбластьСтрока.Параметры.Сумма			= Строка.СуммаВознаграждения;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
		ИтогоСтоимость		= ИтогоСтоимость + Строка.БалансоваяСтоимость;
		ИтогоВознаграждение	= ИтогоВознаграждение + Строка.СуммаВознаграждения;
		НомерСтроки			= НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ИтогоСтоимость		= ИтогоСтоимость;
	ОбластьПодвал.Параметры.ИтогоВознаграждение	= ИтогоВознаграждение;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), , ОриентацияСтраницы.Портрет);	

	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
